// ДЗ 22.09 
// _______________________________________________________
// Вам необходимо самостоятельно решить, для какого задания
// какой цикл лучше использовать: WHILE, DO WHILE или FOR.
// _______________________________________________________
// _______________________________________________________
// 1. Подсчитать сумму всех чисел в заданном пользователем
// диапазоне. 

// let x = parseInt(prompt("Введите первое число из диапазона", "1"));
// let y = parseInt(prompt("Введите второе число из диапазона", "5"));
// let result = 0;
// while (x <= y) {
//     result += x;
//     x++;
// }
// document.write(result);
// _______________________________________________________
// _______________________________________________________
// 2. Запросить 2 числа и найти только наибольший общий
// делитель

let x = parseInt(prompt("Введите первое число", "54"));
let y = parseInt(prompt("Введите второе число", "24"));


// _______________________________________________________