// ДЗ 22.09 
// _______________________________________________________
// Вам необходимо самостоятельно решить, для какого задания
// какой цикл лучше использовать: WHILE, DO WHILE или FOR.
// _______________________________________________________
// _______________________________________________________
// 1. Подсчитать сумму всех чисел в заданном пользователем
// диапазоне. 

// let x = parseInt(prompt("Введите первое число из диапазона", "1"));
// let y = parseInt(prompt("Введите второе число из диапазона", "5"));
// let result = 0;
// while (x <= y) {
//     result += x;
//     x++;
// }
// document.write(result);
// _______________________________________________________
// _______________________________________________________
// 2. Запросить 2 числа и найти только наибольший общий
// делитель

// let x = parseInt(prompt("Введите первое число", "54"));
// let y = parseInt(prompt("Введите второе число", "24"));


// _______________________________________________________

// 3. Запросить у пользователя число и вывести все делители этого числа.



// _______________________________________________________

// 4. Определить количество цифр в введенном числе. 

// _______________________________________________________

// 5. Запросить у пользователя 10 чисел и подсчитать, сколько он ввел положительных, отрицательных и нулей. При этом также посчитать, сколько четных и нечетных. Вывести статистику на экран. Учтите, что достаточно одной переменной (не 10) для ввода чисел пользователем. 

// _______________________________________________________

// 6. Зациклить калькулятор. Запросить у пользователя 2 числа и знак, решить пример, вывести результат и спросить, хочет ли он решить еще один пример. И так до тех пор, пока пользователь не откажется. 
// _______________________________________________________

// 7. Запросить у пользователя число и на сколько цифр его сдвинуть. Сдвинуть цифры числа и вывести результат (если число 123456 сдвинуть на 2 цифры, то получится 345612).
// _______________________________________________________

// 8. Зациклить вывод дней недели таким образом: «День недели. Хотите увидеть следующий день?» и так до тех пор, пока пользователь нажимает OK.
// _______________________________________________________

// 9. Вывести таблицу умножения для всех чисел от 2 до 9. Каждое число необходимо умножить на числа от 1 до 10. 
// _______________________________________________________

// 10. Игра «Угадай число». Предложить пользователю загадать число от 0 до 100 и отгадать его следующим способом: каждую итерацию цикла делите диапазон чисел пополам, записываете результат в N и спрашиваете у пользователя «Ваше число > N, < N или == N?». В зависимости от того что указал пользователь, уменьшаете диапазон. Начальный диапазон от 0 до 100, поделили пополам и получили 50. Если пользователь указал, что его число > 50, то изменили диапазон на от 51 до 100. И так до тех пор, пока пользователь не выберет == N.
// _______________________________________________________
