// document - объект, имеет свои методы (напр. getElementById()) 

Document Object Model - это прикладной программный интерфейс (API) для работы с HTML и XML документами. 
DOM представляет собой древовидную структуру (дерево документа). 
DOM используется для взаимодействия и изменения самой структуры DOM или его отдельных элементов и узлов.
В JS DOM представлен объектом Document. Объект Document имеет большое количество методов для работы с элементами, их созданием, модификацией, удалением и т.д.